guangli2015/google_fast_pair_location_tag_nRF5SDK_17_1_0/ble_gfp.c
/**
 * Copyright (c) 2012 - 2021, Nordic Semiconductor ASA
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */
#include "sdk_common.h"

#include "ble.h"
#include "ble_gfp.h"
#include "ble_srv_common.h"
#include "nrf_crypto.h"
#include "nrf_crypto_ecc.h"
#include "nrf_crypto_ecdh.h"
#include "nrf_crypto_error.h"
#include "nrf_crypto_hash.h"
#include "nrf_queue.h"

#include "crys_ecpki_kg.h"
#include "crys_ecpki_domain.h"
#include "crys_ecpki_build.h"
#include "crys_ecpki_error.h"
#include "sns_silib.h"
#include "mbedtls/ecp.h"
#include "mbedtls/bignum.h"
#include "mbedtls/aes.h"
#define NRF_LOG_MODULE_NAME ble_gfp
#if BLE_GFP_CONFIG_LOG_ENABLED
#define NRF_LOG_LEVEL       BLE_GFP_CONFIG_LOG_LEVEL
#define NRF_LOG_INFO_COLOR  BLE_GFP_CONFIG_INFO_COLOR
#define NRF_LOG_DEBUG_COLOR BLE_GFP_CONFIG_DEBUG_COLOR
#else // BLE_GFP_CONFIG_LOG_ENABLED
#define NRF_LOG_LEVEL       4
#endif // BLE_GFP_CONFIG_LOG_ENABLED
#include "nrf_log.h"
NRF_LOG_MODULE_REGISTER();
#define ACCOUNT_KEYS_COUNT 5
#define FP_ACCOUNT_KEY_LEN	16U

#define FP_CRYPTO_SHA256_HASH_LEN		32U
/** Length of ECDH public key (512 bits = 64 bytes). */
#define FP_CRYPTO_ECDH_PUBLIC_KEY_LEN		64U
/** Length of AES-128 block (128 bits = 16 bytes). */
#define FP_CRYPTO_AES128_BLOCK_LEN		16U
/** Length of AES-256 block (256 bits = 32 bytes). */
#define FP_CRYPTO_AES256_BLOCK_LEN		32U
/** Length of ECDH shared key (256 bits = 32 bytes). */
#define FP_CRYPTO_ECDH_SHARED_KEY_LEN		32U
/** Fast Pair Anti-Spoofing private key length (256 bits = 32 bytes). */
#define FP_REG_DATA_ANTI_SPOOFING_PRIV_KEY_LEN	32U

#define FP_KBP_FLAG_INITIATE_BONDING 0x02

#define BLE_UUID_GFP_MODEL_ID_CHARACTERISTIC 0x1233             
#define BLE_UUID_GFP_KEY_BASED_PAIRING_CHARACTERISTIC 0x1234
#define BLE_UUID_GFP_PASSKEY_CHARACTERISTIC 0x1235 
#define BLE_UUID_GFP_ACCOUNT_KEY_CHARACTERISTIC 0x1236 
#define BLE_UUID_GFP_ADDI_DATA_CHARACTERISTIC 0x1237
#define BLE_UUID_GFP_BEACON_ACTIONS_CHARACTERISTIC 0x1238                  

#define BLE_GFP_MAX_RX_CHAR_LEN        BLE_GFP_MAX_DATA_LEN /**< Maximum length of the RX Characteristic (in bytes). */
#define BLE_GFP_MAX_TX_CHAR_LEN        BLE_GFP_MAX_DATA_LEN /**< Maximum length of the TX Characteristic (in bytes). */

#define GFP_CHARACTERISTIC_BASE_UUID                  {{0xEA, 0x0B, 0x10, 0x32, 0xDE, 0x01, 0xB0, 0x8E, 0x14, 0x48, 0x66, 0x83, 0x00, 0x00, 0x2C, 0xFE}} /**< Used vendor specific UUID. */

#define GFP_SERVICE_UUID  0xFE2C

#define BIT(n)  (1UL << (n))
#define BIT_MASK(n) (BIT(n) - 1UL)

#define WRITE_BIT(var, bit, set) \
	((var) = (set) ? ((var) | BIT(bit)) : ((var) & ~BIT(bit)))

/* Beacon Actions characteristic. */
#define BEACON_ACTIONS_DATA_ID_LEN           1
#define BEACON_ACTIONS_DATA_LENGTH_LEN       1

#define BEACON_ACTIONS_HEADER_LEN       \
	(BEACON_ACTIONS_DATA_ID_LEN +   \
	BEACON_ACTIONS_DATA_LENGTH_LEN)


#define BT_FAST_PAIR_FMDN_VERSION_MAJOR 0x01
#define FP_FMDN_AUTH_SEG_LEN 8
#define BT_FAST_PAIR_FMDN_RANDOM_NONCE_LEN 8
#define BEACON_PARAMETERS_REQ_PAYLOAD_LEN FP_FMDN_AUTH_SEG_LEN
#define BEACON_ACTIONS_RSP_AUTH_SEG_LEN FP_FMDN_AUTH_SEG_LEN

/* Byte length of fields in the Beacon Parameters response. */
#define BEACON_PARAMETERS_RSP_TX_POWER_LEN     1
#define BEACON_PARAMETERS_RSP_CLOCK_LEN        4
#define BEACON_PARAMETERS_RSP_ECC_TYPE_LEN     1
#define BEACON_PARAMETERS_RSP_RINGING_COMP_LEN 1
#define BEACON_PARAMETERS_RSP_RINGING_CAP_LEN  1
#define BEACON_PARAMETERS_RSP_PADDING_LEN      8
#define BEACON_PARAMETERS_RSP_ADD_DATA_LEN       \
	(BEACON_PARAMETERS_RSP_TX_POWER_LEN +    \
	BEACON_PARAMETERS_RSP_CLOCK_LEN +        \
	BEACON_PARAMETERS_RSP_ECC_TYPE_LEN +     \
	BEACON_PARAMETERS_RSP_RINGING_COMP_LEN + \
	BEACON_PARAMETERS_RSP_RINGING_CAP_LEN +  \
	BEACON_PARAMETERS_RSP_PADDING_LEN)
#define BEACON_PARAMETERS_RSP_PAYLOAD_LEN  \
	(BEACON_ACTIONS_RSP_AUTH_SEG_LEN + \
	BEACON_PARAMETERS_RSP_ADD_DATA_LEN)
#define BEACON_PARAMETERS_RSP_LEN          \
	(BEACON_ACTIONS_HEADER_LEN +       \
	BEACON_PARAMETERS_RSP_PAYLOAD_LEN)


/* Byte length of fields in the Provisioning State request. */
#define PROVISIONING_STATE_REQ_PAYLOAD_LEN FP_FMDN_AUTH_SEG_LEN
/* Byte length of fields in the Provisioning State response. */
#define PROVISIONING_STATE_RSP_BITFIELD_LEN 1
#define PROVISIONING_STATE_RSP_EID_LEN      20
#define PROVISIONING_STATE_RSP_ADD_DATA_LEN    \
	(PROVISIONING_STATE_RSP_BITFIELD_LEN + \
	PROVISIONING_STATE_RSP_EID_LEN)
#define PROVISIONING_STATE_RSP_PAYLOAD_LEN   \
	(BEACON_ACTIONS_RSP_AUTH_SEG_LEN +   \
	PROVISIONING_STATE_RSP_ADD_DATA_LEN)
#define PROVISIONING_STATE_RSP_LEN          \
	(BEACON_ACTIONS_HEADER_LEN +        \
	PROVISIONING_STATE_RSP_PAYLOAD_LEN)

