guangli2015/google_fast_pair_location_tag_nRF5SDK_17_1_0/ble_gfp.c
/* Byte length of the EIK hash field from the Ephemeral Identity Key Set/Clear request. */
#define EPHEMERAL_IDENTITY_KEY_REQ_EIK_HASH_LEN 8

/* Byte length of fields in the Ephemeral Identity Key Set request. */
#define EPHEMERAL_IDENTITY_KEY_SET_REQ_EIK_LEN 32
#define EPHEMERAL_IDENTITY_KEY_SET_REQ_UNPROVISIONED_PAYLOAD_LEN \
	(FP_FMDN_AUTH_SEG_LEN +                  \
	EPHEMERAL_IDENTITY_KEY_SET_REQ_EIK_LEN)
#define EPHEMERAL_IDENTITY_KEY_SET_REQ_PROVISIONED_PAYLOAD_LEN      \
	(EPHEMERAL_IDENTITY_KEY_SET_REQ_UNPROVISIONED_PAYLOAD_LEN + \
	EPHEMERAL_IDENTITY_KEY_REQ_EIK_HASH_LEN)

/* Byte length of fields in the Ephemeral Identity Key Set response. */
#define EPHEMERAL_IDENTITY_KEY_SET_RSP_PAYLOAD_LEN \
	(BEACON_ACTIONS_RSP_AUTH_SEG_LEN)
#define EPHEMERAL_IDENTITY_KEY_SET_RSP_LEN \
	(BEACON_ACTIONS_HEADER_LEN +       \
	EPHEMERAL_IDENTITY_KEY_SET_RSP_PAYLOAD_LEN)

/* Constants used to generate a seed for Ephemeral Identifier. */
#define FMDN_EID_SEED_ROT_PERIOD_EXP   10
#define FMDN_EID_SEED_PADDING_TYPE_ONE 0xFF
#define FMDN_EID_SEED_PADDING_TYPE_TWO 0x00

/* Byte length and offset of fields used to generate a seed for Ephemeral Identifier. */
#define FMDN_EID_SEED_PADDING_LEN        11
#define FMDN_EID_SEED_ROT_PERIOD_EXP_LEN 1
#define FMDN_EID_SEED_FMDN_CLOCK_LEN     sizeof(uint32_t)
#define FMDN_EID_SEED_LEN                    \
	((FMDN_EID_SEED_PADDING_LEN +        \
	  FMDN_EID_SEED_ROT_PERIOD_EXP_LEN + \
	  FMDN_EID_SEED_FMDN_CLOCK_LEN) * 2)

#define FP_FMDN_STATE_EID_LEN 32



/* Fast Pair message type. */
enum fp_msg_type {
	/* Key-based Pairing Request. */
	FP_MSG_KEY_BASED_PAIRING_REQ    = 0x00,

	/* Key-based Pairing Response. */
	FP_MSG_KEY_BASED_PAIRING_RSP    = 0x01,

	/* Seeker's Passkey. */
	FP_MSG_SEEKERS_PASSKEY          = 0x02,

	/* Provider's Passkey. */
	FP_MSG_PROVIDERS_PASSKEY        = 0x03,

	/* Action request. */
	FP_MSG_ACTION_REQ               = 0x10,
};

enum fp_field_type {
	FP_FIELD_TYPE_SHOW_PAIRING_UI_INDICATION = 0b0000,
	FP_FIELD_TYPE_SALT			 = 0b0001,
	FP_FIELD_TYPE_HIDE_PAIRING_UI_INDICATION = 0b0010,
};


enum beacon_actions_data_id {
	BEACON_ACTIONS_BEACON_PARAMETERS_READ       = 0x00,
	BEACON_ACTIONS_PROVISIONING_STATE_READ      = 0x01,
	BEACON_ACTIONS_EPHEMERAL_IDENTITY_KEY_SET   = 0x02,
	BEACON_ACTIONS_EPHEMERAL_IDENTITY_KEY_CLEAR = 0x03,
	BEACON_ACTIONS_EPHEMERAL_IDENTITY_KEY_READ  = 0x04,
	BEACON_ACTIONS_RING                         = 0x05,
	BEACON_ACTIONS_RINGING_STATE_READ           = 0x06,
	BEACON_ACTIONS_ACTIVATE_UTP_MODE            = 0x07,
	BEACON_ACTIONS_DEACTIVATE_UTP_MODE          = 0x08,
};

typedef struct  {
	uint8_t account_key[FP_CRYPTO_AES128_BLOCK_LEN];
} account_key_t;

NRF_QUEUE_DEF(account_key_t, account_key_queue, ACCOUNT_KEYS_COUNT, NRF_QUEUE_MODE_OVERFLOW);

//struct account_keys account_key_arr[ACCOUNT_KEYS_COUNT];

//static uint8_t anti_spoofing_priv_key[FP_REG_DATA_ANTI_SPOOFING_PRIV_KEY_LEN]={0x52 , 0x7a , 0x21 , 0xfa , 0x7c , 0x9c , 0x2b , 0xf6 , 0x49 , 0xee , 0x4d , 0xdd , 0x1e , 0xc7 , 0x5c , 0x36 , 0x98 , 0x8f , 0xd5 , 0x27 , 0xce , 0xcb , 0x43 , 0xff , 0x2f , 0x1e , 0x57 , 0x8b , 0x1c , 0x98 , 0xa2 , 0x2b};

static uint8_t anti_spoofing_priv_key[FP_REG_DATA_ANTI_SPOOFING_PRIV_KEY_LEN] = {0xae , 0x27 , 0xb5 , 0xd0 , 0xe , 0xce , 0x36 , 0xac , 0x1d , 0xef , 0xb5 , 0x66 , 0x93 , 0x11 , 0xac , 0x6e , 0x53 , 0xd4 , 0x6c , 0xcb , 0x77 , 0xf3 , 0x8a , 0xa3 , 0xe , 0x7 , 0x4 , 0x27 , 0xf7 , 0x2d , 0x4f , 0xd6};
struct msg_kbp_req_data {
	uint8_t seeker_address[6];
};

struct msg_action_req_data {
	uint8_t msg_group;
	uint8_t msg_code;
	uint8_t additional_data_len_or_id;
	uint8_t additional_data[5];
};

union kbp_write_msg_specific_data {
	struct msg_kbp_req_data kbp_req;
	struct msg_action_req_data action_req;
};

struct msg_kbp_write {
	uint8_t msg_type;
	uint8_t fp_flags;
	uint8_t provider_address[6];
	union kbp_write_msg_specific_data data;
};

struct msg_seekers_passkey {
	uint8_t msg_type;
	uint32_t passkey;
};

/** Authentication seed data */
struct fp_fmdn_auth_data {
	/** Random Nonce */
	const uint8_t *Prandom_nonce;

	/** Data ID */
	uint8_t data_id;

	/** Data Length */
	uint8_t data_len;

	/** Additional Data */
	const uint8_t *add_data;
};

static uint8_t  Anti_Spoofing_AES_Key[NRF_CRYPTO_HASH_SIZE_SHA256];
extern bool key_pairing_success;
extern uint8_t dis_passkey[6 + 1];

static uint8_t random_nonce[8];
static volatile bool beacon_provisioned = false;
static uint8_t owner_account_key[FP_CRYPTO_AES128_BLOCK_LEN];

extern volatile uint32_t  fmdn_clock;//sec
static uint8_t new_eik[EPHEMERAL_IDENTITY_KEY_SET_REQ_EIK_LEN];
//function********************************************************************
static int provisioning_state_read_handle(uint8_t *data,uint16_t len);
static int beacon_parameters_read_handle(uint8_t *data,uint16_t len);

static size_t fp_crypto_account_key_filter_size(size_t n)
{
	if (n == 0) {
		return 0;
	} else {
		return 1.2 * n + 3;
	}
}
static  void gfp_memcpy_swap(void *dst, const void *src, size_t length)
{
	uint8_t *pdst = (uint8_t *)dst;
	const uint8_t *psrc = (const uint8_t *)src;

	ASSERT(((psrc < pdst && (psrc + length) <= pdst) ||
		  (psrc > pdst && (pdst + length) <= psrc)));

	psrc += length - 1;

	for (; length > 0; length--) {
		*pdst++ = *psrc--;
	}
}
static inline void sys_put_be16(uint16_t val, uint8_t dst[2])
{
	dst[0] = val >> 8;
	dst[1] = val;
}
static inline void sys_put_be32(uint32_t val, uint8_t dst[4])
{
	sys_put_be16(val >> 16, dst);
	sys_put_be16(val, &dst[2]);
}
static inline uint16_t sys_get_be16(const uint8_t src[2])
{
	return ((uint16_t)src[0] << 8) | src[1];
}

static inline uint32_t sys_get_be32(const uint8_t src[4])
{
	return ((uint32_t)sys_get_be16(&src[0]) << 16) | sys_get_be16(&src[2]);
}

//crypto ********************************************************************
static void print_array(uint8_t const * p_string, size_t size)
{
    #if NRF_LOG_ENABLED
    size_t i;
    NRF_LOG_RAW_INFO("    ");
    for(i = 0; i < size; i++)
    {
        NRF_LOG_RAW_INFO("%02x ", p_string[i]);
    }
    #endif // NRF_LOG_ENABLED
}


static void print_hex(char const * p_msg, uint8_t const * p_data, size_t size)
{
    NRF_LOG_INFO(p_msg);
    print_array(p_data, size);
    NRF_LOG_RAW_INFO("\r\n");
}
static ret_code_t fp_crypto_ecdh_shared_secret(uint8_t *secret_key, const uint8_t *public_key,
				 const uint8_t *private_key)
{
     nrf_crypto_ecc_private_key_t              alice_private_key;
     nrf_crypto_ecc_public_key_t               bob_public_key;

