guangli2015/google_fast_pair_location_tag_nRF5SDK_17_1_0/ble_gfp.c
	}
        NRF_LOG_INFO("requ:%x %x\n",parsed_req.msg_type,parsed_req.fp_flags);
        print_hex(" raw_req: ", raw_req, 16);

        print_hex(" provider_address: ", parsed_req.provider_address, 6);

        ble_gap_addr_t addr;
        err_code = sd_ble_gap_addr_get(&addr);
        if(NRF_SUCCESS != err_code)
        {
          NRF_LOG_ERROR("sd_ble_gap_addr_get err %x\n",err_code);
        }
        
    
        uint8_t rsp[FP_CRYPTO_AES128_BLOCK_LEN];
        rsp[0] = FP_MSG_KEY_BASED_PAIRING_RSP;
        gfp_memcpy_swap(rsp+1, addr.addr,6);
        print_hex("rsp: ", rsp, 16);

        nrf_crypto_aes_context_t      ecb_encr_ctx;
        uint8_t encrypted_rsp[FP_CRYPTO_AES128_BLOCK_LEN];
        len_out = 16;
           /* Encrypt text with integrated function */
        err_code = nrf_crypto_aes_crypt(&ecb_encr_ctx,
                                   p_ecb_info,
                                   NRF_CRYPTO_ENCRYPT,
                                   Anti_Spoofing_AES_Key,
                                   NULL,
                                   (uint8_t *)rsp,
                                   16,
                                   (uint8_t *)encrypted_rsp,
                                   &len_out);
        if(NRF_SUCCESS != err_code)
        {
          NRF_LOG_ERROR("nrf_crypto_aes_crypt err %x\n",err_code);
        }

        ble_gatts_hvx_params_t     hvx_params;
        memset(&hvx_params, 0, sizeof(hvx_params));
        len_out = FP_CRYPTO_AES128_BLOCK_LEN;
        hvx_params.handle = p_gfp->keybase_pair_handles.value_handle;
        hvx_params.p_data = encrypted_rsp;
        hvx_params.p_len  = &len_out;
        hvx_params.type   = BLE_GATT_HVX_NOTIFICATION;

        err_code = sd_ble_gatts_hvx(p_ble_evt->evt.gatts_evt.conn_handle, &hvx_params);
         if(NRF_SUCCESS != err_code)
        {
          NRF_LOG_ERROR("sd_ble_gatts_hvx err %x\n",err_code);
        }



                     

    }
    else if ((p_evt_write->handle == p_gfp->passkey_handles.value_handle) )
    {

        NRF_LOG_INFO("passkey_handles################################\n");
        nrf_crypto_aes_info_t const * p_ecb_info_passkey;
   
        nrf_crypto_aes_context_t      ecb_decr_ctx_passkey;
        p_ecb_info_passkey = &g_nrf_crypto_aes_ecb_128_info;
        size_t      len_out_passkey;
        uint8_t raw_req_passkey[FP_CRYPTO_AES128_BLOCK_LEN];
        err_code = nrf_crypto_aes_init(&ecb_decr_ctx_passkey,
                                  p_ecb_info_passkey,
                                  NRF_CRYPTO_DECRYPT);
        if(NRF_SUCCESS != err_code)
        {
          NRF_LOG_ERROR("nrf_crypto_aes_init err %x\n",err_code);
        }

        /* Set encryption and decryption key */

        err_code = nrf_crypto_aes_key_set(&ecb_decr_ctx_passkey, Anti_Spoofing_AES_Key);
        if(NRF_SUCCESS != err_code)
        {
          NRF_LOG_ERROR("nrf_crypto_aes_key_set err %x\n",err_code);
        }

        /* Decrypt blocks */
        len_out_passkey = sizeof(raw_req_passkey);
        err_code = nrf_crypto_aes_finalize(&ecb_decr_ctx_passkey,
                                      (uint8_t *)p_evt_write->data,
                                      FP_CRYPTO_AES128_BLOCK_LEN,
                                      (uint8_t *)raw_req_passkey,
                                      &len_out_passkey);
        if(NRF_SUCCESS != err_code)
        {
          NRF_LOG_ERROR("nrf_crypto_aes_finalize err %x\n",err_code);
          memset(Anti_Spoofing_AES_Key,0xff,NRF_CRYPTO_HASH_SIZE_SHA256);//drop the K
          return;
        }

        struct msg_seekers_passkey parsed_req_passkey;
        parsed_req_passkey.msg_type = raw_req_passkey[0];
        parsed_req_passkey.passkey  = (raw_req_passkey[1] << 16) | (raw_req_passkey[2] << 8) | raw_req_passkey[3];
        uint32_t dis_pass_result = 0;

        for (size_t i = 0; i < 6; i++) 
        {
          dis_pass_result = dis_pass_result * 10 + (dis_passkey[i]-0x30);
        }

         NRF_LOG_INFO("raw req passkey %x %x %x %x\n",raw_req_passkey[1],raw_req_passkey[2],raw_req_passkey[3],parsed_req_passkey.passkey);
         NRF_LOG_INFO("dis_pass_result %x\n",dis_pass_result);

         if(parsed_req_passkey.passkey == dis_pass_result)
         {

            err_code = sd_ble_gap_auth_key_reply(p_ble_evt->evt.gatts_evt.conn_handle, BLE_GAP_AUTH_KEY_TYPE_PASSKEY, NULL);
            if (err_code != NRF_SUCCESS) 
            {
              NRF_LOG_ERROR("Failed to confirm passkey (err %d)\n", err_code);
            }
         }

        // resp
         uint8_t rsp_passkey[FP_CRYPTO_AES128_BLOCK_LEN];
         rsp_passkey[0] = FP_MSG_PROVIDERS_PASSKEY;
         rsp_passkey[1] = raw_req_passkey[1];
         rsp_passkey[2] = raw_req_passkey[2];
         rsp_passkey[3] = raw_req_passkey[3];

        nrf_crypto_aes_context_t      ecb_encr_ctx_passkey;
        uint8_t encrypted_rsp_passkey[FP_CRYPTO_AES128_BLOCK_LEN];
        len_out_passkey = 16;
           /* Encrypt text with integrated function */
        err_code = nrf_crypto_aes_crypt(&ecb_encr_ctx_passkey,
                                   p_ecb_info_passkey,
                                   NRF_CRYPTO_ENCRYPT,
                                   Anti_Spoofing_AES_Key,
                                   NULL,
                                   (uint8_t *)rsp_passkey,
                                   16,
                                   (uint8_t *)encrypted_rsp_passkey,
                                   &len_out_passkey);
        if(NRF_SUCCESS != err_code)
        {
          NRF_LOG_ERROR("nrf_crypto_aes_crypt err %x\n",err_code);
        }

        ble_gatts_hvx_params_t     hvx_params_passkey;
        memset(&hvx_params_passkey, 0, sizeof(hvx_params_passkey));
        len_out_passkey = FP_CRYPTO_AES128_BLOCK_LEN;
        hvx_params_passkey.handle = p_gfp->passkey_handles.value_handle;
        hvx_params_passkey.p_data = encrypted_rsp_passkey;
        hvx_params_passkey.p_len  = &len_out_passkey;
        hvx_params_passkey.type   = BLE_GATT_HVX_NOTIFICATION;

        err_code = sd_ble_gatts_hvx(p_ble_evt->evt.gatts_evt.conn_handle, &hvx_params_passkey);
         if(NRF_SUCCESS != err_code)
        {
          NRF_LOG_ERROR("sd_ble_gatts_hvx err %x\n",err_code);
        }
        key_pairing_success = true;
        NRF_LOG_INFO("passkey_handles################################end\n");
                     

