guangli2015/google_fast_pair_location_tag_nRF5SDK_17_1_0/ble_gfp.c
    }
        else if ((p_evt_write->handle == p_gfp->account_key_handles.value_handle) )
    {

        NRF_LOG_INFO("account_key_handles################################\n");
        //if( false == key_pairing_success)
        //{
        //  return ;
        //}
        nrf_crypto_aes_info_t const * p_ecb_info_accountkey;
   
        nrf_crypto_aes_context_t      ecb_decr_ctx_accountkey;
        p_ecb_info_accountkey = &g_nrf_crypto_aes_ecb_128_info;
        size_t      len_out_accountkey;
        uint8_t raw_req_accountkey[FP_CRYPTO_AES128_BLOCK_LEN];
        err_code = nrf_crypto_aes_init(&ecb_decr_ctx_accountkey,
                                  p_ecb_info_accountkey,
                                  NRF_CRYPTO_DECRYPT);
        if(NRF_SUCCESS != err_code)
        {
          NRF_LOG_ERROR("nrf_crypto_aes_init err %x\n",err_code);
        }

        /* Set encryption and decryption key */

        err_code = nrf_crypto_aes_key_set(&ecb_decr_ctx_accountkey, Anti_Spoofing_AES_Key);
        if(NRF_SUCCESS != err_code)
        {
          NRF_LOG_ERROR("nrf_crypto_aes_key_set err %x\n",err_code);
        }

        /* Decrypt blocks */
        len_out_accountkey = sizeof(raw_req_accountkey);
        err_code = nrf_crypto_aes_finalize(&ecb_decr_ctx_accountkey,
                                      (uint8_t *)p_evt_write->data,
                                      FP_CRYPTO_AES128_BLOCK_LEN,
                                      (uint8_t *)raw_req_accountkey,
                                      &len_out_accountkey);
        if(NRF_SUCCESS != err_code)
        {
          NRF_LOG_ERROR("nrf_crypto_aes_finalize err %x\n",err_code);
        }
  print_hex("acckeyadd",raw_req_accountkey,16);
        if(0x04 != raw_req_accountkey[0])
        {
          return;
        }

        account_key_t data;
        for(int i=0;i<FP_CRYPTO_AES128_BLOCK_LEN;i++)
        {
          data.account_key[i] = raw_req_accountkey[i];
        }
        print_hex("acckeyadd",raw_req_accountkey,16);
//test
        //uint8_t testacc[16]={0x4 , 0xa6 , 0xef , 0x67 , 0x5a , 0xb8 , 0xac , 0x2d , 0xd4 , 0x67 , 0x4f , 0xe8 , 0xbf , 0x6c , 0x4f , 0xf5};
        // for(int i=0;i<FP_CRYPTO_AES128_BLOCK_LEN;i++)
        //{
        //  data.account_key[i] = testacc[i];
        //}
        
        err_code = nrf_queue_push(&account_key_queue,&data);
        if(NRF_SUCCESS != err_code)
        {
          NRF_LOG_ERROR("nrf_queue_push err %x\n",err_code);
        }

                      

    }
    else if ((p_evt_write->handle == p_gfp->addi_data_handles.value_handle) )
    {

         NRF_LOG_INFO("addi_data_handles################################\n");
                      

    }
    else if ((p_evt_write->handle == p_gfp->beacon_actions_handles.value_handle) )
    {
       uint8_t data_id;
       uint8_t data_len;
       NRF_LOG_INFO("beacon_actions_handles################################\n");
       data_id = p_evt_write->data[0];
       data_len = p_evt_write->data[1];
       switch (data_id) 
       {
	case BEACON_ACTIONS_BEACON_PARAMETERS_READ:
		 beacon_parameters_read_handle(p_evt_write->data,p_evt_write->len);
		break;
	case BEACON_ACTIONS_PROVISIONING_STATE_READ:
		 provisioning_state_read_handle(p_evt_write->data,p_evt_write->len);
		break;
	case BEACON_ACTIONS_EPHEMERAL_IDENTITY_KEY_SET:
		//res = ephemeral_identity_key_set_handle(conn, attr, &fmdn_beacon_actions_buf);
		break;
	case BEACON_ACTIONS_EPHEMERAL_IDENTITY_KEY_CLEAR:
		//res = ephemeral_identity_key_clear_handle(conn, attr, &fmdn_beacon_actions_buf);
		break;
	case BEACON_ACTIONS_EPHEMERAL_IDENTITY_KEY_READ:
		//res = ephemeral_identity_key_read_handle(conn, attr, &fmdn_beacon_actions_buf);
		break;
	case BEACON_ACTIONS_RING:
		//res = ring_handle(conn, attr, &fmdn_beacon_actions_buf);
		break;
	case BEACON_ACTIONS_RINGING_STATE_READ:
		//res = ringing_state_read_handle(conn, attr, &fmdn_beacon_actions_buf);
		break;
	case BEACON_ACTIONS_ACTIVATE_UTP_MODE:
		//res = activate_utp_mode_handle(conn, attr, &fmdn_beacon_actions_buf);
		break;
	case BEACON_ACTIONS_DEACTIVATE_UTP_MODE:
		//res = deactivate_utp_mode_handle(conn, attr, &fmdn_beacon_actions_buf);
		break;
	default:
		NRF_LOG_ERROR("Beacon Actions: unrecognized request: data_id=%d", data_id);
		
	}
                      

    }
    else
    {
        // Do Nothing. This event is not relevant for this service.
    }
}

static void on_read(ble_gfp_t * p_gfp, ble_evt_t const * p_ble_evt)
{
    ble_gatts_evt_rw_authorize_request_t const * evt_rw_auth =
        &p_ble_evt->evt.gatts_evt.params.authorize_request;

    uint8_t rsp[1+8];
    if (evt_rw_auth->type != BLE_GATTS_AUTHORIZE_TYPE_READ)
    {
        // Unexpected operation
        NRF_LOG_INFO(" W_AUTHORIZE_REQUEST Unexpected operation \n");
        return;
    }

    /* Update SD GATTS values of appropriate host before SD sends the Read Response */
    if (evt_rw_auth->request.read.handle == p_gfp->beacon_actions_handles.value_handle)
    {
            ret_code_t                                   err_code;
            ble_gatts_rw_authorize_reply_params_t        auth_read_params;
          
            ble_gatts_evt_rw_authorize_request_t const * p_read_auth =
              &p_ble_evt->evt.gatts_evt.params.authorize_request;

        NRF_LOG_INFO("ON W_AUTHORIZE_REQUEST readrsp\n");

        err_code = nrf_crypto_rng_vector_generate(random_nonce, 8);
        if(NRF_SUCCESS != err_code)
        {
              NRF_LOG_ERROR("nrf_crypto_rng_vector_generate err %x\n",err_code);
        }
        rsp[0] = BT_FAST_PAIR_FMDN_VERSION_MAJOR;
        memcpy(rsp+1,random_nonce,8);


        memset(&auth_read_params, 0, sizeof(auth_read_params));
        auth_read_params.type                    = BLE_GATTS_AUTHORIZE_TYPE_READ;
        auth_read_params.params.read.gatt_status = BLE_GATT_STATUS_SUCCESS;
        auth_read_params.params.read.offset      = p_read_auth->request.read.offset;
        auth_read_params.params.read.len         = 9;
        auth_read_params.params.read.p_data      = &rsp;
        auth_read_params.params.read.update      = 1;

        err_code = sd_ble_gatts_rw_authorize_reply(p_ble_evt->evt.gap_evt.conn_handle,
                                                   &auth_read_params);
        if(NRF_SUCCESS != err_code)
        {
              NRF_LOG_ERROR("sd_ble_gatts_rw_authorize_reply err %x\n",err_code);
        }
    }
}

void ble_gfp_on_ble_evt(ble_evt_t const * p_ble_evt, void * p_context)
{
    if ((p_context == NULL) || (p_ble_evt == NULL))
    {
        return;
    }

    ble_gfp_t * p_gfp = (ble_gfp_t *)p_context;

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
            //on_connect(p_gfp, p_ble_evt);
            break;

