guangli2015/google_fast_pair_location_tag_nRF5SDK_17_1_0/ble_gfp.c
    // Finish calculation
    err_code = nrf_crypto_hmac_finalize(&m_context, local_auth_seg, &local_auth_seg_len);
     if(NRF_SUCCESS != err_code)
      {
        NRF_LOG_ERROR("nrf_crypto_hmac_finalize err %x\n",err_code);
      }
    print_hex(" Pauth_seg ", Pauth_seg, 8);
    print_hex(" local_auth_seg ", local_auth_seg, 8);
   if(!memcmp(local_auth_seg, Pauth_seg, FP_FMDN_AUTH_SEG_LEN))
   {
      memcpy(owner_account_key,accountkey_array[i].account_key,FP_CRYPTO_AES128_BLOCK_LEN);
      return true;
   }
  }
  return false;
}
static int beacon_parameters_read_handle(uint8_t *data,uint16_t len)
{
    uint8_t auth_seg[FP_FMDN_AUTH_SEG_LEN];
    uint8_t auth_data_buf[100];
    size_t auth_data_buf_len = 0;
    bool result =false;
    static const uint8_t req_data_len = BEACON_PARAMETERS_REQ_PAYLOAD_LEN;
  static const uint8_t rsp_data_len = BEACON_PARAMETERS_RSP_PAYLOAD_LEN;
    struct fp_fmdn_auth_data auth_data;
    memcpy(auth_seg,data+2,FP_FMDN_AUTH_SEG_LEN);

    memset(&auth_data, 0, sizeof(auth_data));
    auth_data.Prandom_nonce = &random_nonce;
    auth_data.data_id = BEACON_ACTIONS_BEACON_PARAMETERS_READ;
    auth_data.data_len = req_data_len;

    auth_data_encode(auth_data_buf,&auth_data,&auth_data_buf_len);

    result = account_key_find_iterator(auth_data_buf,auth_data_buf_len,auth_seg);

    NRF_LOG_INFO("beacon_parameters_read_handle result %x\n",result);



}
static int provisioning_state_read_handle(uint8_t *data,uint16_t len)
{
    uint8_t auth_seg[FP_FMDN_AUTH_SEG_LEN];
    uint8_t auth_data_buf[100];
    size_t auth_data_buf_len = 0;
    bool result =false;
   // bool provisioned = false;
    static const uint8_t req_data_len = PROVISIONING_STATE_REQ_PAYLOAD_LEN;
    uint8_t rsp_data_len;
    struct fp_fmdn_auth_data auth_data;
    memcpy(auth_seg,data+2,FP_FMDN_AUTH_SEG_LEN);

    memset(&auth_data, 0, sizeof(auth_data));
    auth_data.Prandom_nonce = &random_nonce;
    auth_data.data_id = BEACON_ACTIONS_PROVISIONING_STATE_READ;
    auth_data.data_len = req_data_len;

    auth_data_encode(auth_data_buf,&auth_data,&auth_data_buf_len);
    print_hex(" auth_data_buf1: ", auth_data_buf, auth_data_buf_len);
     print_hex(" auth_segget ", auth_seg, 8);
    result = account_key_find_iterator(auth_data_buf,auth_data_buf_len,auth_seg);

    NRF_LOG_INFO("provisioning_state_read_handle result %x\n",result);

    /* Prepare response payload. */
	//rsp_data_len = provisioned ? PROVISIONING_STATE_RSP_PAYLOAD_LEN :
	//	(PROVISIONING_STATE_RSP_PAYLOAD_LEN - PROVISIONING_STATE_RSP_EID_LEN);



}

static ret_code_t fp_crypto_aes256_ecb_encryptwithEik( uint8_t *output, uint8_t *input)
{
//    uint8_t input[] = {
//    0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff, 0xff,
//    0xff, 0xff, 0xff, 0x0a, 0x12, 0x34, 0x54, 0x00,
//    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
//    0x00, 0x00, 0x00, 0x0a, 0x12, 0x34, 0x54, 0x00,
//};

//// ????256???
//  uint8_t aes_ecb_256_key[] = {
//    0x01, 0x23, 0x45, 0x67, 0x89, 0xab, 0xcd, 0xef,
//    0x01, 0x23, 0x45, 0x67, 0x89, 0xab, 0xcd, 0xef,
//    0x01, 0x23, 0x45, 0x67, 0x89, 0xab, 0xcd, 0xef,
//    0x01, 0x23, 0x45, 0x67, 0x89, 0xab, 0xcd, 0xef,
//};

//  uint8_t encrypted_data[32];
ret_code_t            err_code;
  mbedtls_aes_context aes_ctx;
     NRF_LOG_INFO("aes ecb 256 encrypt start:\n");

    mbedtls_aes_init(&aes_ctx);
    
 
    err_code = mbedtls_aes_setkey_enc(&aes_ctx, new_eik, 256);
    if (err_code != 0) {
        NRF_LOG_INFO("Failed to set encryption key, error: %d", err_code);
        goto cleanup1;
    }

    mbedtls_aes_crypt_ecb(&aes_ctx, MBEDTLS_AES_ENCRYPT, input, output);
    if (err_code != 0) {
           NRF_LOG_INFO("Decryption failed at block %d, error: %d", 16, err_code);
            goto cleanup1;
        }
    mbedtls_aes_crypt_ecb(&aes_ctx, MBEDTLS_AES_ENCRYPT, input + 16, output + 16);
   if (err_code != 0) {
           NRF_LOG_INFO("Decryption failed at block %d, error: %d", 16, err_code);
            goto cleanup1;
        }

    NRF_LOG_INFO("Encrypted data (hex):\n");

    NRF_LOG_HEXDUMP_INFO(output,32);
    NRF_LOG_INFO("\n");
cleanup1:
    mbedtls_aes_free(&aes_ctx);
    return err_code;
  



}


static ret_code_t calculate_secp256r1_point(uint8_t *out,uint8_t *mod,uint8_t *in)
{
 ret_code_t err_code;
   
    // 1. Initialize mbedtls contexts
    mbedtls_ecp_group grp;
    mbedtls_mpi in_mpi, in_prime_mpi, n_mpi, out1_mpi, out2_mpi;
    mbedtls_ecp_point P;
mbedtls_ecp_group_init(&grp);
    mbedtls_mpi_init(&in_mpi);
    mbedtls_mpi_init(&in_prime_mpi);
    mbedtls_mpi_init(&n_mpi);
    mbedtls_ecp_point_init(&P);
    mbedtls_mpi_init(&out1_mpi);
    mbedtls_mpi_init(&out2_mpi);

// 2. Set up the elliptic curve group (secp256r1)
    err_code = mbedtls_ecp_group_load(&grp, MBEDTLS_ECP_DP_SECP256R1);
    if (err_code != 0) {
        NRF_LOG_INFO("Failed to load secp256r1 group: %d\n", err_code);
        goto cleanup;
    }
// 3. Convert the input scalar 'in' to an mbedtls bignum
    //unsigned char in[] = {
    //    0x52, 0xc7, 0x46, 0xbf, 0x4a, 0xb7, 0xc7, 0xc3,
    //    0x5f, 0x0d, 0xdb, 0x3b, 0x2c, 0x86, 0x32, 0xd1,
    //    0x29, 0xf0, 0xa0, 0x45, 0x3f, 0x76, 0x76, 0x7a,
    //    0x29, 0xf0, 0x33, 0xd0, 0x0d, 0xee, 0x96, 0xba,
    //};
    err_code = mbedtls_mpi_read_binary(&in_mpi, in, 32);
    if (err_code != 0) {
        NRF_LOG_INFO("Failed to read input scalar: %d\n", err_code);
        goto cleanup;
    }
// 4. Calculate in' = in mod n
    err_code = mbedtls_mpi_copy(&n_mpi, &grp.N); // Copy the order of the curve (n)
    if (err_code != 0) {
        NRF_LOG_INFO("Failed to copy group order: %d\n", err_code);
        goto cleanup;
    }
    err_code = mbedtls_mpi_mod_mpi(&in_prime_mpi, &in_mpi, &n_mpi);
    if (err_code != 0) {
        NRF_LOG_INFO("Failed to calculate in mod n: %d\n", err_code);
        goto cleanup;
    }
    // Convert in_prime_mpi to a byte array for comparison
 //   unsigned char in_prime_calculated[32];
    err_code = mbedtls_mpi_write_binary(&in_prime_mpi, mod, 32);
     if (err_code != 0) {
        NRF_LOG_INFO("Failed to write in_prime to binary: %d\n", err_code);
        goto cleanup;
    }

